LoadTesting/scripts/getAnnotationsForUserBook_Paged_250.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 260.929ms, rate sampling interval: 1044ms
  Thread calibration: mean lat.: 193.121ms, rate sampling interval: 620ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   304.24ms  502.35ms   4.06s    94.58%
    Req/Sec   123.33    271.81     0.98k    84.95%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  194.30ms
 75.000%  276.48ms
 90.000%  426.24ms
 99.000%    2.99s 
 99.900%    3.89s 
 99.990%    4.05s 
 99.999%    4.06s 
100.000%    4.06s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.731     0.000000            1         1.00
      78.463     0.100000         7153         1.11
     111.103     0.200000        14292         1.25
     137.855     0.300000        21456         1.43
     165.503     0.400000        28593         1.67
     194.303     0.500000        35732         2.00
     208.127     0.550000        39300         2.22
     222.591     0.600000        42882         2.50
     238.335     0.650000        46447         2.86
     255.359     0.700000        50004         3.33
     276.479     0.750000        53612         4.00
     288.511     0.775000        55373         4.44
     303.615     0.800000        57162         5.00
     321.791     0.825000        58937         5.71
     345.343     0.850000        60719         6.67
     376.575     0.875000        62504         8.00
     397.311     0.887500        63401         8.89
     426.239     0.900000        64295        10.00
     463.615     0.912500        65184        11.43
     523.775     0.925000        66076        13.33
     674.303     0.937500        66968        16.00
     775.679     0.943750        67415        17.78
     871.423     0.950000        67864        20.00
     989.183     0.956250        68308        22.86
    1087.487     0.962500        68755        26.67
    1258.495     0.968750        69201        32.00
    1376.255     0.971875        69423        35.56
    2430.975     0.975000        69653        40.00
    2559.999     0.978125        69873        45.71
    2658.303     0.981250        70102        53.33
    2732.031     0.984375        70324        64.00
    2793.471     0.985938        70429        71.11
    2869.247     0.987500        70549        80.00
    2934.783     0.989062        70652        91.43
    3618.815     0.990625        70765       106.67
    3663.871     0.992188        70874       128.00
    3688.447     0.992969        70931       142.22
    3717.119     0.993750        70988       160.00
    3741.695     0.994531        71047       182.86
    3764.223     0.995313        71102       213.33
    3782.655     0.996094        71154       256.00
    3792.895     0.996484        71183       284.44
    3809.279     0.996875        71210       320.00
    3825.663     0.997266        71238       365.71
    3837.951     0.997656        71266       426.67
    3852.287     0.998047        71295       512.00
    3858.431     0.998242        71308       568.89
    3862.527     0.998437        71322       640.00
    3868.671     0.998633        71337       731.43
    3876.863     0.998828        71349       853.33
    3889.151     0.999023        71363      1024.00
    3893.247     0.999121        71372      1137.78
    3895.295     0.999219        71378      1280.00
    3901.439     0.999316        71384      1462.86
    3909.631     0.999414        71391      1706.67
    3919.871     0.999512        71400      2048.00
    3921.919     0.999561        71402      2275.56
    3930.111     0.999609        71405      2560.00
    3934.207     0.999658        71408      2925.71
    4040.703     0.999707        71413      3413.33
    4044.799     0.999756        71416      4096.00
    4046.847     0.999780        71418      4551.11
    4048.895     0.999805        71422      5120.00
    4048.895     0.999829        71422      5851.43
    4048.895     0.999854        71422      6826.67
    4050.943     0.999878        71425      8192.00
    4050.943     0.999890        71425      9102.22
    4052.991     0.999902        71427     10240.00
    4052.991     0.999915        71427     11702.86
    4052.991     0.999927        71427     13653.33
    4055.039     0.999939        71428     16384.00
    4057.087     0.999945        71429     18204.44
    4057.087     0.999951        71429     20480.00
    4057.087     0.999957        71429     23405.71
    4059.135     0.999963        71431     27306.67
    4059.135     0.999969        71431     32768.00
    4059.135     0.999973        71431     36408.89
    4059.135     0.999976        71431     40960.00
    4059.135     0.999979        71431     46811.43
    4059.135     0.999982        71431     54613.33
    4059.135     0.999985        71431     65536.00
    4061.183     0.999986        71432     72817.78
    4061.183     1.000000        71432          inf
#[Mean    =      304.241, StdDeviation   =      502.347]
#[Max     =     4059.136, Total count    =        71432]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  75225 requests in 5.00m, 13.70MB read
  Socket errors: connect 0, read 0, write 0, timeout 885
Requests/sec:    250.65
Transfer/sec:     46.75KB