LoadTesting/scripts/getAnnotationsForUserBook_Paged_250.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 230.644ms, rate sampling interval: 957ms
  Thread calibration: mean lat.: 175.562ms, rate sampling interval: 642ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   225.99ms  158.84ms   1.57s    83.96%
    Req/Sec   124.41    269.71     0.94k    83.38%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  200.06ms
 75.000%  281.09ms
 90.000%  375.04ms
 99.000%    1.02s 
 99.900%    1.36s 
 99.990%    1.56s 
 99.999%    1.57s 
100.000%    1.57s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.561     0.000000            1         1.00
      81.535     0.100000         7207         1.11
     113.855     0.200000        14445         1.25
     143.103     0.300000        21618         1.43
     172.415     0.400000        28800         1.67
     200.063     0.500000        36007         2.00
     214.655     0.550000        39630         2.22
     228.991     0.600000        43213         2.50
     245.119     0.650000        46835         2.86
     262.655     0.700000        50423         3.33
     281.087     0.750000        53994         4.00
     291.583     0.775000        55796         4.44
     303.103     0.800000        57606         5.00
     316.927     0.825000        59466         5.71
     332.543     0.850000        61210         6.67
     351.231     0.875000        62991         8.00
     361.983     0.887500        63896         8.89
     375.295     0.900000        64803        10.00
     389.887     0.912500        65698        11.43
     408.063     0.925000        66593        13.33
     429.823     0.937500        67498        16.00
     442.623     0.943750        67940        17.78
     457.215     0.950000        68391        20.00
     473.343     0.956250        68841        22.86
     492.799     0.962500        69299        26.67
     517.631     0.968750        69740        32.00
     535.039     0.971875        69969        35.56
     555.007     0.975000        70190        40.00
     578.559     0.978125        70420        45.71
     618.495     0.981250        70639        53.33
     842.751     0.984375        70866        64.00
     893.439     0.985938        70976        71.11
     925.695     0.987500        71089        80.00
     994.303     0.989062        71207        91.43
    1036.799     0.990625        71316       106.67
    1078.271     0.992188        71431       128.00
    1095.679     0.992969        71486       142.22
    1111.039     0.993750        71539       160.00
    1128.447     0.994531        71595       182.86
    1148.927     0.995313        71651       213.33
    1181.695     0.996094        71710       256.00
    1198.079     0.996484        71735       284.44
    1220.607     0.996875        71768       320.00
    1241.087     0.997266        71795       365.71
    1257.471     0.997656        71820       426.67
    1292.287     0.998047        71848       512.00
    1306.623     0.998242        71863       568.89
    1325.055     0.998437        71876       640.00
    1340.415     0.998633        71890       731.43
    1349.631     0.998828        71904       853.33
    1360.895     0.999023        71918      1024.00
    1367.039     0.999121        71926      1137.78
    1372.159     0.999219        71932      1280.00
    1512.447     0.999316        71939      1462.86
    1520.639     0.999414        71946      1706.67
    1529.855     0.999512        71953      2048.00
    1533.951     0.999561        71957      2275.56
    1538.047     0.999609        71960      2560.00
    1542.143     0.999658        71964      2925.71
    1545.215     0.999707        71967      3413.33
    1550.335     0.999756        71971      4096.00
    1552.383     0.999780        71973      4551.11
    1553.407     0.999805        71974      5120.00
    1556.479     0.999829        71976      5851.43
    1558.527     0.999854        71978      6826.67
    1560.575     0.999878        71980      8192.00
    1561.599     0.999890        71981      9102.22
    1561.599     0.999902        71981     10240.00
    1562.623     0.999915        71982     11702.86
    1563.647     0.999927        71983     13653.33
    1565.695     0.999939        71984     16384.00
    1566.719     0.999945        71985     18204.44
    1566.719     0.999951        71985     20480.00
    1566.719     0.999957        71985     23405.71
    1567.743     0.999963        71986     27306.67
    1567.743     0.999969        71986     32768.00
    1568.767     0.999973        71987     36408.89
    1568.767     0.999976        71987     40960.00
    1568.767     0.999979        71987     46811.43
    1568.767     0.999982        71987     54613.33
    1568.767     0.999985        71987     65536.00
    1569.791     0.999986        71988     72817.78
    1569.791     1.000000        71988          inf
#[Mean    =      225.993, StdDeviation   =      158.841]
#[Max     =     1568.768, Total count    =        71988]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  75117 requests in 5.00m, 13.68MB read
  Socket errors: connect 0, read 0, write 0, timeout 884
Requests/sec:    250.27
Transfer/sec:     46.68KB